app/lib/misc/rubytest/log.txt

# Logfile created on 2018-06-26 13:00:52 +0900 by logger.rb/56815
I, [2018-06-26T13:00:58.301333 #8872]  INFO -- : SOAP request: https://mrdk-dev-ed.my.salesforce.com/services/Soap/m/42.0/00D7F0000004Ad6
I, [2018-06-26T13:00:58.301333 #8872]  INFO -- : SOAPAction: "readMetadata", Content-Type: text/xml;charset=UTF-8, Content-Length: 619
D, [2018-06-26T13:00:58.302333 #8872] DEBUG -- : <?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="http://soap.sforce.com/2006/04/metadata" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
  <env:Header>
    <tns:SessionHeader>
      <tns:sessionId>00D7F0000004Ad6!AQMAQLlBQklJLobNA6bXBy3caDV5Er37FyQmw0flLwQ7.rTo1CzZXmuxP4gmAByXcXBNGbhlLB_86OXksPzZxHtOKtrecIBA</tns:sessionId>
    </tns:SessionHeader>
  </env:Header>
  <env:Body>
    <tns:readMetadata>
      <tns:metadataType>CustomLabel</tns:metadataType>
      <tns:fullNames>CNH</tns:fullNames>
    </tns:readMetadata>
  </env:Body>
</env:Envelope>

D, [2018-06-26T13:00:58.302333 #8872] DEBUG -- : HTTPI TLSv1_2/peer POST request to mrdk-dev-ed.my.salesforce.com (excon)
I, [2018-06-26T13:01:03.611864 #8872]  INFO -- : SOAP response (status 200)
D, [2018-06-26T13:01:03.673870 #8872] DEBUG -- : <?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns="http://soap.sforce.com/2006/04/metadata" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soapenv:Body>
    <readMetadataResponse>
      <result>
        <records xsi:type="CustomLabel">
          <fullName>CNH</fullName>
          <language>ja</language>
          <protected>true</protected>
          <shortDescription>CNH</shortDescription>
          <value>商品リスト（2017/○○以降）&lt;BR&gt;
1：素敵生活サービスメニュー―関東&lt;BR&gt;
2：素敵生活サービスメニュー―関西&lt;BR&gt;
3： ○○○ ○○○ ○○○ ○○○ ○○○&lt;BR&gt;
4： ××× ××× ××× ××× ×××&lt;BR&gt;</value>
        </records>
      </result>
    </readMetadataResponse>
  </soapenv:Body>
</soapenv:Envelope>

